aleksMuhicFri2/stm32n6-edge-audio-classifier/Projects/GS/Src/audio_display.c
/**
  ******************************************************************************
  * @file    audio_display.c
  * @brief   Product-style acoustic safety dashboard for the STM32N6570-DK.
  *
  * The dashboard renders into a hidden RGB565 framebuffer and presents it at
  * LTDC vertical blank. It groups inference windows into real-world audio
  * sessions, retains one event per session, latches warning/danger alerts, and
  * keeps a short event history.
  ******************************************************************************
  */

#include "audio_display.h"

#include <stdio.h>
#include <string.h>

#include "stm32n6xx_hal.h"
#include "stm32n6570_discovery_conf.h"
#include "mcu_cache.h"

#define DISPLAY_WIDTH                    800U
#define DISPLAY_HEIGHT                   480U
#define DISPLAY_BYTES_PER_PIXEL          2U
#define DISPLAY_FB_BYTES                 (DISPLAY_WIDTH * DISPLAY_HEIGHT * DISPLAY_BYTES_PER_PIXEL)
#define DASHBOARD_HISTORY_COUNT          3U
#define DASHBOARD_CLASS_SWITCH_CONFIRM_WINDOWS  2U

/* RGB565 product palette. */
#define COLOR_BACKGROUND                 0x0883U
#define COLOR_HEADER                     0x0927U
#define COLOR_CARD                       0x1148U
#define COLOR_CARD_ALT                   0x19AAU
#define COLOR_DIVIDER                    0x2A6DU
#define COLOR_WHITE                      0xFFFFU
#define COLOR_MUTED                      0x9D34U
#define COLOR_CYAN                       0x2E5BU
#define COLOR_GREEN                      0x36D2U
#define COLOR_ORANGE                     0xFD84U
#define COLOR_RED                        0xFA6BU
#define COLOR_BLUE                       0x5D5FU
#define COLOR_BAR_BACKGROUND             0x324EU

typedef struct
{
  char character;
  uint8_t rows[7];
} Glyph5x7_t;

typedef enum
{
  HAZARD_INFO = 0,
  HAZARD_WARNING,
  HAZARD_DANGER
} HazardLevel_t;

typedef struct
{
  const char *model_label;
  const char *display_label;
  HazardLevel_t hazard;
} SoundProfile_t;

typedef struct
{
  char label[24];
  uint32_t confidence_percent;
  uint32_t timestamp_seconds;
  HazardLevel_t hazard;
  bool valid;
} DashboardEvent_t;

static const Glyph5x7_t s_glyphs[] =
{
  {' ', {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}},
  {'%', {0x19, 0x19, 0x02, 0x04, 0x08, 0x13, 0x13}},
  {'-', {0x00, 0x00, 0x00, 0x1F, 0x00, 0x00, 0x00}},
  {'.', {0x00, 0x00, 0x00, 0x00, 0x00, 0x0C, 0x0C}},
  {':', {0x00, 0x0C, 0x0C, 0x00, 0x0C, 0x0C, 0x00}},
  {'/', {0x01, 0x02, 0x02, 0x04, 0x08, 0x08, 0x10}},
  {'0', {0x0E, 0x11, 0x13, 0x15, 0x19, 0x11, 0x0E}},
  {'1', {0x04, 0x0C, 0x14, 0x04, 0x04, 0x04, 0x1F}},
  {'2', {0x0E, 0x11, 0x01, 0x02, 0x04, 0x08, 0x1F}},
  {'3', {0x1E, 0x01, 0x01, 0x0E, 0x01, 0x01, 0x1E}},
  {'4', {0x02, 0x06, 0x0A, 0x12, 0x1F, 0x02, 0x02}},
  {'5', {0x1F, 0x10, 0x10, 0x1E, 0x01, 0x01, 0x1E}},
  {'6', {0x0E, 0x10, 0x10, 0x1E, 0x11, 0x11, 0x0E}},
  {'7', {0x1F, 0x01, 0x02, 0x04, 0x08, 0x08, 0x08}},
  {'8', {0x0E, 0x11, 0x11, 0x0E, 0x11, 0x11, 0x0E}},
  {'9', {0x0E, 0x11, 0x11, 0x0F, 0x01, 0x01, 0x0E}},
  {'A', {0x0E, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11}},
  {'B', {0x1E, 0x11, 0x11, 0x1E, 0x11, 0x11, 0x1E}},
  {'C', {0x0E, 0x11, 0x10, 0x10, 0x10, 0x11, 0x0E}},
  {'D', {0x1E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x1E}},
  {'E', {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x1F}},
  {'F', {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x10}},
  {'G', {0x0E, 0x11, 0x10, 0x17, 0x11, 0x11, 0x0F}},
  {'H', {0x11, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11}},
  {'I', {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04, 0x1F}},
  {'J', {0x07, 0x02, 0x02, 0x02, 0x12, 0x12, 0x0C}},
  {'K', {0x11, 0x12, 0x14, 0x18, 0x14, 0x12, 0x11}},
  {'L', {0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x1F}},
  {'M', {0x11, 0x1B, 0x15, 0x15, 0x11, 0x11, 0x11}},
  {'N', {0x11, 0x19, 0x19, 0x15, 0x13, 0x13, 0x11}},
  {'O', {0x0E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E}},
  {'P', {0x1E, 0x11, 0x11, 0x1E, 0x10, 0x10, 0x10}},
  {'Q', {0x0E, 0x11, 0x11, 0x11, 0x15, 0x12, 0x0D}},
  {'R', {0x1E, 0x11, 0x11, 0x1E, 0x14, 0x12, 0x11}},
  {'S', {0x0F, 0x10, 0x10, 0x0E, 0x01, 0x01, 0x1E}},
  {'T', {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04, 0x04}},
  {'U', {0x11, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E}},
  {'V', {0x11, 0x11, 0x11, 0x11, 0x11, 0x0A, 0x04}},
  {'W', {0x11, 0x11, 0x11, 0x15, 0x15, 0x15, 0x0A}},
  {'X', {0x11, 0x11, 0x0A, 0x04, 0x0A, 0x11, 0x11}},
  {'Y', {0x11, 0x11, 0x0A, 0x04, 0x04, 0x04, 0x04}},
  {'Z', {0x1F, 0x01, 0x02, 0x04, 0x08, 0x10, 0x1F}}
};

static const SoundProfile_t s_sound_profiles[] =
{
  {"chainsaw",         "CHAINSAW",        HAZARD_DANGER},
  {"clapping",         "CLAPPING",        HAZARD_INFO},
  {"coughing",         "COUGHING",        HAZARD_WARNING},
  {"crackling_fire",   "CRACKLING FIRE",  HAZARD_DANGER},
  {"crying_baby",      "CRYING BABY",     HAZARD_WARNING},
  {"dog",              "DOG BARKING",     HAZARD_INFO},
  {"door_wood_knock",  "DOOR KNOCK",      HAZARD_WARNING},
  {"footsteps",        "FOOTSTEPS",       HAZARD_WARNING},
  {"glass_breaking",   "GLASS BREAKING",  HAZARD_DANGER},
  {"siren",            "SIREN",           HAZARD_DANGER}
};

static volatile uint16_t *s_framebuffer =
    (volatile uint16_t *)LCD_LAYER_0_ADDRESS;
static uint32_t s_active_framebuffer_address = LCD_LAYER_0_ADDRESS;
static bool s_display_ready;
static volatile bool s_acknowledge_requested;
static volatile bool s_monitoring_enabled = true;
static bool s_session_active;
static bool s_session_recognized;
static char s_session_label[24];
static uint32_t s_session_percent;
static HazardLevel_t s_session_hazard;
static char s_challenger_label[24];
static uint32_t s_challenger_count;
static DashboardEvent_t s_history[DASHBOARD_HISTORY_COUNT];
static uint32_t s_event_count;
static uint32_t s_alert_count;
static bool s_alert_latched;
static char s_alert_label[24];
static HazardLevel_t s_alert_hazard;
static uint32_t s_last_render_second = UINT32_MAX;
static char s_last_decision[24];
static uint32_t s_last_decision_percent = UINT32_MAX;
static char s_last_top_labels[AUDIO_EVENT_TOP_COUNT][24];
static uint32_t s_last_top_percent[AUDIO_EVENT_TOP_COUNT] =
    {UINT32_MAX, UINT32_MAX, UINT32_MAX};

static uint32_t confidence_percent(float confidence)
{
  return (confidence <= 0.0F) ? 0U :
         ((confidence >= 1.0F) ? 100U :
          (uint32_t)(confidence * 100.0F + 0.5F));
}

static const uint8_t *glyph_rows(char character)
{
  for (uint32_t index = 0U; index < (sizeof(s_glyphs) / sizeof(s_glyphs[0])); index++)
  {
    if (s_glyphs[index].character == character)
    {
      return s_glyphs[index].rows;
    }
  }
  return s_glyphs[0].rows;
}

