aleksMuhicFri2/stm32n6-edge-audio-classifier/Projects/GS/Src/audio_display.c
static char display_character(char character)
{
  if ((character >= 'a') && (character <= 'z'))
  {
    return (char)(character - ('a' - 'A'));
  }
  if (character == '_')
  {
    return ' ';
  }
  return character;
}

static void fill_rect(uint32_t x, uint32_t y, uint32_t width, uint32_t height,
                      uint16_t color)
{
  if ((x >= DISPLAY_WIDTH) || (y >= DISPLAY_HEIGHT))
  {
    return;
  }
  if ((x + width) > DISPLAY_WIDTH)
  {
    width = DISPLAY_WIDTH - x;
  }
  if ((y + height) > DISPLAY_HEIGHT)
  {
    height = DISPLAY_HEIGHT - y;
  }

  for (uint32_t row = 0U; row < height; row++)
  {
    volatile uint16_t *pixel = &s_framebuffer[(y + row) * DISPLAY_WIDTH + x];
    for (uint32_t column = 0U; column < width; column++)
    {
      pixel[column] = color;
    }
  }
}

static void outline_rect(uint32_t x, uint32_t y, uint32_t width, uint32_t height,
                         uint32_t thickness, uint16_t color)
{
  fill_rect(x, y, width, thickness, color);
  fill_rect(x, y + height - thickness, width, thickness, color);
  fill_rect(x, y, thickness, height, color);
  fill_rect(x + width - thickness, y, thickness, height, color);
}

static void draw_character(uint32_t x, uint32_t y, char character,
                           uint32_t scale, uint16_t color)
{
  const uint8_t *rows = glyph_rows(display_character(character));
  for (uint32_t row = 0U; row < 7U; row++)
  {
    for (uint32_t column = 0U; column < 5U; column++)
    {
      if ((rows[row] & (1U << (4U - column))) != 0U)
      {
        fill_rect(x + column * scale, y + row * scale, scale, scale, color);
      }
    }
  }
}

static void draw_text(uint32_t x, uint32_t y, const char *text,
                      uint32_t scale, uint16_t color)
{
  while (*text != '\0')
  {
    draw_character(x, y, *text, scale, color);
    x += 6U * scale;
    text++;
  }
}

static uint32_t text_width(const char *text, uint32_t scale)
{
  const uint32_t length = (uint32_t)strlen(text);
  return (length == 0U) ? 0U : (length * 6U * scale - scale);
}

static void draw_text_centered_in(uint32_t x, uint32_t width, uint32_t y,
                                  const char *text, uint32_t scale,
                                  uint16_t color)
{
  const uint32_t rendered_width = text_width(text, scale);
  draw_text(x + ((rendered_width < width) ? ((width - rendered_width) / 2U) : 0U),
            y, text, scale, color);
}

static void draw_level_bars(uint32_t x, uint32_t y, uint16_t color)
{
  fill_rect(x, y + 12U, 5U, 10U, color);
  fill_rect(x + 10U, y + 6U, 5U, 16U, color);
  fill_rect(x + 20U, y, 5U, 22U, color);
  fill_rect(x + 30U, y + 8U, 5U, 14U, color);
}

static void clean_framebuffer(void)
{
  const uint32_t address = (uint32_t)s_framebuffer;
  mcu_cache_clean_range(address, address + DISPLAY_FB_BYTES);
  __DSB();
}

static void select_inactive_framebuffer(void)
{
  const uint32_t inactive_address =
      (s_active_framebuffer_address == LCD_LAYER_0_ADDRESS) ?
      LCD_LAYER_1_ADDRESS : LCD_LAYER_0_ADDRESS;
  s_framebuffer = (volatile uint16_t *)inactive_address;
}

static void present_framebuffer(void)
{
  const uint32_t address = (uint32_t)s_framebuffer;

  /* VBR defers the address reload until vertical blank, so every visible LCD
   * scan uses one complete frame.  Updates arrive much slower than one frame,
   * therefore the next render cannot overtake this pending swap. */
  LTDC_Layer1->CFBAR = address;
  LTDC_Layer1->RCR = LTDC_LxRCR_VBR | LTDC_LxRCR_GRMSK;
  s_active_framebuffer_address = address;
}

static const SoundProfile_t *find_profile(const char *model_label)
{
  for (uint32_t index = 0U;
       index < (sizeof(s_sound_profiles) / sizeof(s_sound_profiles[0]));
       index++)
  {
    if (strcmp(model_label, s_sound_profiles[index].model_label) == 0)
    {
      return &s_sound_profiles[index];
    }
  }
  return NULL;
}

static const char *friendly_label(const char *model_label)
{
  const SoundProfile_t *profile = find_profile(model_label);
  return (profile == NULL) ? model_label : profile->display_label;
}

static HazardLevel_t hazard_for_label(const char *model_label)
{
  const SoundProfile_t *profile = find_profile(model_label);
  return (profile == NULL) ? HAZARD_INFO : profile->hazard;
}

static const char *hazard_text(HazardLevel_t hazard)
{
  if (hazard == HAZARD_DANGER)
  {
    return "DANGER";
  }
  if (hazard == HAZARD_WARNING)
  {
    return "ATTENTION";
  }
  return "INFORMATION";
}

static uint16_t hazard_color(HazardLevel_t hazard)
{
  if (hazard == HAZARD_DANGER)
  {
    return COLOR_RED;
  }
  if (hazard == HAZARD_WARNING)
  {
    return COLOR_ORANGE;
  }
  return COLOR_BLUE;
}

static void format_elapsed(uint32_t seconds, char *text, size_t text_size)
{
  const uint32_t minutes = (seconds / 60U) % 100U;
  const uint32_t remaining_seconds = seconds % 60U;
  (void)snprintf(text, text_size, "%02lu:%02lu",
                 (unsigned long)minutes,
                 (unsigned long)remaining_seconds);
}

static void add_event(const char *label, uint32_t percent, HazardLevel_t hazard,
                      uint32_t timestamp_seconds)
{
  for (uint32_t index = DASHBOARD_HISTORY_COUNT - 1U; index > 0U; index--)
  {
    s_history[index] = s_history[index - 1U];
  }

  (void)snprintf(s_history[0].label, sizeof(s_history[0].label), "%s", label);
  s_history[0].confidence_percent = percent;
  s_history[0].timestamp_seconds = timestamp_seconds;
  s_history[0].hazard = hazard;
  s_history[0].valid = true;
  s_event_count++;
  if (hazard != HAZARD_INFO)
  {
    s_alert_count++;
  }
}

static void revise_current_event(const char *label, uint32_t percent,
                                 HazardLevel_t hazard)
{
  if (!s_history[0].valid)
  {
    return;
  }

  if ((s_history[0].hazard == HAZARD_INFO) && (hazard != HAZARD_INFO))
  {
    s_alert_count++;
  }
  else if ((s_history[0].hazard != HAZARD_INFO) && (hazard == HAZARD_INFO) &&
           (s_alert_count > 0U))
  {
    s_alert_count--;
  }

  (void)snprintf(s_history[0].label, sizeof(s_history[0].label), "%s", label);
  s_history[0].confidence_percent = percent;
  s_history[0].hazard = hazard;
}

