aleksMuhicFri2/stm32n6-edge-audio-classifier/Projects/GS/Src/audio_display.c
static void latch_alert(const char *label, HazardLevel_t hazard)
{
  if ((hazard == HAZARD_INFO) ||
      (s_alert_latched && (hazard < s_alert_hazard)))
  {
    return;
  }

  s_alert_latched = true;
  s_alert_hazard = hazard;
  (void)snprintf(s_alert_label, sizeof(s_alert_label), "%s", label);
}

static void update_audio_session(const char *decision_label, uint32_t percent,
                                 uint32_t now_seconds)
{
  const bool waiting = (strcmp(decision_label, "waiting") == 0);
  const bool unknown = (strcmp(decision_label, "unknown") == 0);

  if (waiting)
  {
    s_session_active = false;
    s_session_recognized = false;
    s_session_label[0] = '\0';
    s_session_percent = 0U;
    s_session_hazard = HAZARD_INFO;
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
    return;
  }

  if (!s_session_active)
  {
    s_session_active = true;
    s_session_recognized = false;
    s_session_label[0] = '\0';
    s_session_percent = 0U;
    s_session_hazard = HAZARD_INFO;
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
  }

  if (unknown)
  {
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
    return;
  }

  const char *display_label = friendly_label(decision_label);
  const HazardLevel_t hazard = hazard_for_label(decision_label);

  if (!s_session_recognized)
  {
    s_session_recognized = true;
    (void)snprintf(s_session_label, sizeof(s_session_label), "%s", display_label);
    s_session_percent = percent;
    s_session_hazard = hazard;
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
    add_event(display_label, percent, hazard, now_seconds);
    latch_alert(display_label, hazard);
  }
  else if (strcmp(s_session_label, display_label) == 0)
  {
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
    if (percent > s_session_percent)
    {
      s_session_percent = percent;
      s_history[0].confidence_percent = percent;
    }
  }
  else
  {
    if (strcmp(s_challenger_label, display_label) == 0)
    {
      s_challenger_count++;
    }
    else
    {
      (void)snprintf(s_challenger_label, sizeof(s_challenger_label),
                     "%s", display_label);
      s_challenger_count = 1U;
    }

    if (s_challenger_count >= DASHBOARD_CLASS_SWITCH_CONFIRM_WINDOWS)
    {
      const bool revising_latched_alert =
          s_alert_latched && (strcmp(s_alert_label, s_session_label) == 0);
      (void)snprintf(s_session_label, sizeof(s_session_label), "%s", display_label);
      s_session_percent = percent;
      s_session_hazard = hazard;
      s_challenger_label[0] = '\0';
      s_challenger_count = 0U;
      revise_current_event(display_label, percent, hazard);
      if (revising_latched_alert && (hazard == HAZARD_INFO))
      {
        s_alert_latched = false;
        s_alert_label[0] = '\0';
        s_alert_hazard = HAZARD_INFO;
      }
      latch_alert(display_label, hazard);
    }
  }
}

static void draw_header(void)
{
  char uptime[20];
  char status[32];
  const uint32_t now_seconds = HAL_GetTick() / 1000U;

  fill_rect(0U, 0U, DISPLAY_WIDTH, 64U, COLOR_HEADER);
  fill_rect(0U, 62U, DISPLAY_WIDTH, 2U, COLOR_CYAN);
  draw_level_bars(22U, 20U, COLOR_CYAN);
  draw_text(70U, 16U, "ACOUSTIC SAFETY MONITOR", 3U, COLOR_WHITE);
  draw_text(70U, 43U, "EDGE AI ENVIRONMENTAL AWARENESS", 1U, COLOR_MUTED);

  format_elapsed(now_seconds, uptime, sizeof(uptime));
  (void)snprintf(status, sizeof(status), "UP %s", uptime);
  draw_text(645U, 12U, status, 1U, COLOR_MUTED);
  fill_rect(645U, 31U, 131U, 22U, COLOR_CARD_ALT);
  fill_rect(654U, 38U, 8U, 8U,
            s_monitoring_enabled ? COLOR_GREEN : COLOR_ORANGE);
  draw_text(671U, 36U,
            s_monitoring_enabled ? "NPU ONLINE" : "PAUSED",
            1U, s_monitoring_enabled ? COLOR_GREEN : COLOR_ORANGE);
}

static void draw_confidence(uint32_t percent, uint16_t color)
{
  char text[32];
  const uint32_t bar_width = (percent > 100U) ? 400U : 4U * percent;

  (void)snprintf(text, sizeof(text), "CONFIDENCE %lu%%",
                 (unsigned long)percent);
  draw_text(48U, 267U, text, 2U, COLOR_MUTED);
  fill_rect(48U, 291U, 400U, 12U, COLOR_BAR_BACKGROUND);
  fill_rect(48U, 291U, bar_width, 12U, color);
}

static void draw_top_predictions(
    const char *const top_labels[AUDIO_EVENT_TOP_COUNT],
    const uint32_t top_percent[AUDIO_EVENT_TOP_COUNT])
{
  char row_text[48];

  draw_text(48U, 321U, "LIVE MODEL OUTPUT", 1U, COLOR_MUTED);
  for (uint32_t rank = 0U; rank < AUDIO_EVENT_TOP_COUNT; rank++)
  {
    (void)snprintf(row_text, sizeof(row_text), "%lu  %-16s %3lu%%",
                   (unsigned long)(rank + 1U),
                   friendly_label(top_labels[rank]),
                   (unsigned long)top_percent[rank]);
    draw_text(48U, 342U + rank * 20U, row_text, 1U,
              (rank == 0U) ? COLOR_WHITE : COLOR_MUTED);
  }
}

static void draw_live_card(
    const char *decision_label,
    uint32_t decision_percent,
    const char *const top_labels[AUDIO_EVENT_TOP_COUNT],
    const uint32_t top_percent[AUDIO_EVENT_TOP_COUNT])
{
  const bool waiting = (strcmp(decision_label, "waiting") == 0);
  const bool unknown = (strcmp(decision_label, "unknown") == 0);
  const char *primary_label = NULL;
  const char *subtitle = NULL;
  uint16_t accent = COLOR_GREEN;
  uint32_t label_scale = 5U;

  fill_rect(22U, 80U, 510U, 336U, COLOR_CARD);
  outline_rect(22U, 80U, 510U, 336U, 1U, COLOR_DIVIDER);
  draw_text(44U, 98U, "LIVE ANALYSIS", 2U, COLOR_MUTED);

  if (!s_monitoring_enabled)
  {
    fill_rect(407U, 96U, 100U, 23U, COLOR_ORANGE);
    draw_text_centered_in(407U, 100U, 101U, "PAUSED", 1U, COLOR_BACKGROUND);
    primary_label = "MONITOR PAUSED";
    subtitle = "PRESS USER1 TO RESUME";
    accent = COLOR_ORANGE;
  }
  else if (!waiting)
  {
    const HazardLevel_t live_hazard = hazard_for_label(top_labels[0]);
    const char *badge = unknown ? "LOW CONF" : hazard_text(live_hazard);

    accent = unknown ? COLOR_ORANGE : hazard_color(live_hazard);
    fill_rect(386U, 96U, 121U, 23U, accent);
    draw_text_centered_in(386U, 121U, 101U,
                          badge, 1U, COLOR_BACKGROUND);
    primary_label = friendly_label(top_labels[0]);
    subtitle = unknown ? "CURRENT TOP MODEL PREDICTION" :
                         "LIVE CLASSIFIER RESULT";
    decision_percent = top_percent[0];
  }
  else
  {
    fill_rect(386U, 96U, 121U, 23U, COLOR_GREEN);
    draw_text_centered_in(386U, 121U, 101U, "ALL CLEAR", 1U, COLOR_BACKGROUND);
    primary_label = "MONITORING";
    subtitle = "LISTENING FOR 10 SOUND EVENTS";
    decision_percent = 0U;
  }

  if (text_width(primary_label, label_scale) > 450U)
  {
    label_scale = 4U;
  }
  draw_text_centered_in(44U, 466U, 155U, primary_label, label_scale, COLOR_WHITE);
  draw_text_centered_in(44U, 466U, 207U, subtitle, 1U, COLOR_MUTED);

  if (s_monitoring_enabled && (!waiting || s_session_recognized))
  {
    draw_confidence(decision_percent, accent);
    draw_top_predictions(top_labels, top_percent);
  }
  else
  {
    draw_level_bars(238U, 266U, accent);
    draw_text_centered_in(44U, 466U, 319U,
                          s_monitoring_enabled ?
                          "MICROPHONE ACTIVE" : "INFERENCE SUSPENDED",
                          2U, accent);
    draw_text_centered_in(44U, 466U, 354U,
                          "YAMNET 256 / NEURAL ART NPU",
                          1U, COLOR_MUTED);
  }
}

static void draw_stat_box(uint32_t x, const char *title, uint32_t value,
                          uint16_t color)
{
  char text[12];
  fill_rect(x, 121U, 99U, 62U, COLOR_CARD_ALT);
  draw_text_centered_in(x, 99U, 130U, title, 1U, COLOR_MUTED);
  (void)snprintf(text, sizeof(text), "%lu", (unsigned long)value);
  draw_text_centered_in(x, 99U, 150U, text, 3U, color);
}

