aleksMuhicFri2/stm32n6-edge-audio-classifier/Projects/GS/Src/audio_display.c
bool AudioDisplay_Init(void)
{
  static const char *initial_top_labels[AUDIO_EVENT_TOP_COUNT] =
      {"chainsaw", "clapping", "coughing"};
  static const uint32_t initial_top_percent[AUDIO_EVENT_TOP_COUNT] = {0U, 0U, 0U};

  s_display_ready = false;
  s_acknowledge_requested = false;
  s_monitoring_enabled = true;
  s_framebuffer = (volatile uint16_t *)LCD_LAYER_0_ADDRESS;
  s_active_framebuffer_address = LCD_LAYER_0_ADDRESS;
  s_session_active = false;
  s_session_recognized = false;
  s_session_label[0] = '\0';
  s_session_percent = 0U;
  s_session_hazard = HAZARD_INFO;
  s_challenger_label[0] = '\0';
  s_challenger_count = 0U;
  memset(s_history, 0, sizeof(s_history));
  s_event_count = 0U;
  s_alert_count = 0U;
  s_alert_latched = false;
  s_alert_label[0] = '\0';
  s_alert_hazard = HAZARD_INFO;
  s_last_render_second = UINT32_MAX;
  s_last_decision[0] = '\0';
  s_last_decision_percent = UINT32_MAX;
  for (uint32_t rank = 0U; rank < AUDIO_EVENT_TOP_COUNT; rank++)
  {
    s_last_top_labels[rank][0] = '\0';
    s_last_top_percent[rank] = UINT32_MAX;
  }

  render_dashboard("waiting", 0U, initial_top_labels, initial_top_percent);
  s_display_ready = configure_panel();
  return s_display_ready;
}

void AudioDisplay_RequestAcknowledge(void)
{
  s_acknowledge_requested = true;
}

void AudioDisplay_SetMonitoring(bool enabled)
{
  s_monitoring_enabled = enabled;
  s_last_render_second = UINT32_MAX;
}

void AudioDisplay_Update(
    const char *decision_label,
    float decision_confidence,
    const char *const top_labels[AUDIO_EVENT_TOP_COUNT],
    const float top_scores[AUDIO_EVENT_TOP_COUNT],
    bool show_predictions)
{
  char current_label[24];
  uint32_t current_percent;
  uint32_t top_percent[AUDIO_EVENT_TOP_COUNT];
  const uint32_t now_seconds = HAL_GetTick() / 1000U;
  bool unchanged;
  bool force_render = false;

  (void)show_predictions;

  if ((!s_display_ready) || (decision_label == NULL) ||
      (top_labels == NULL) || (top_scores == NULL))
  {
    return;
  }

  if (s_acknowledge_requested)
  {
    s_acknowledge_requested = false;
    s_alert_latched = false;
    s_alert_label[0] = '\0';
    s_alert_hazard = HAZARD_INFO;
    force_render = true;
  }

  current_percent = confidence_percent(decision_confidence);
  (void)snprintf(current_label, sizeof(current_label), "%s", decision_label);
  update_audio_session(current_label, current_percent, now_seconds);

  unchanged = (!force_render) &&
              (strcmp(current_label, s_last_decision) == 0) &&
              (current_percent == s_last_decision_percent) &&
              (now_seconds == s_last_render_second);
  for (uint32_t rank = 0U; rank < AUDIO_EVENT_TOP_COUNT; rank++)
  {
    top_percent[rank] = confidence_percent(top_scores[rank]);
    unchanged = unchanged &&
                (strcmp(top_labels[rank], s_last_top_labels[rank]) == 0) &&
                (top_percent[rank] == s_last_top_percent[rank]);
  }

  if (unchanged)
  {
    return;
  }

  (void)snprintf(s_last_decision, sizeof(s_last_decision), "%s", current_label);
  s_last_decision_percent = current_percent;
  s_last_render_second = now_seconds;
  for (uint32_t rank = 0U; rank < AUDIO_EVENT_TOP_COUNT; rank++)
  {
    (void)snprintf(s_last_top_labels[rank], sizeof(s_last_top_labels[rank]),
                   "%s", top_labels[rank]);
    s_last_top_percent[rank] = top_percent[rank];
  }

  select_inactive_framebuffer();
  render_dashboard(current_label, current_percent, top_labels, top_percent);
  present_framebuffer();
}
